$(document).ready(function() {
  var subTitles = [{
      url: "04_01.html",
      subTitle: 'STEAM 수업 구성'
    },
    {
      url: "04_02.html",
      subTitle: '오늘의 주제를 미리 살펴보는 시간입니다.<br />여러분, ‘4차 산업혁명’이라는 말 들어보셨나요? 4차 산업혁명이란 인공지능, 빅데이터 등 디지털 기술로 촉발되는 초연결 기반의 지능화 혁명이라고 할 수 있습니다. 과학적 사고와 디지털 기술 중심의 변화가 일어나고 있는 현재를 살아가는 우리에게 과학기술 기반의 융합적 사고력과 실생활 문제 해결력을 함양하기 위한 STEAM교육이 얼마나 중요한지 실감할 수 있습니다. 그렇다면 STEAM 교육은 학교에서 어떻게 적용하고 또 운영하면 좋을까요? STEAM 수업을 실천하기 위해서는 먼저 ‘STEAM 수업에 쏙 빠져들게 만드는 매력적인 주제’를 찾아야 합니다. 주제가 결정되면 각 교과별 성취기준에 맞게 효과적으로 교육할 수 있도록 적절한 수업활동을 고민합니다. 이때 STEAM 교수학습 준거에 맞춰 차시별로 구성해 주시면 됩니다. 그리고 STEAM 교육은 여러 교과 간 연계가 이뤄지는 경우가 많기 때문에 교과 연계 필요시 연계 교과 교사와 논의를 해볼 수도 있습니다. 그럼, 지금부터 STEAM 수업을 시작하는 방법, STEAM 수업 계획, STEAM 수업 실천에 대해 학습할 예정입니다. 이번 차시를 통해 여러분은 STEAM 수업에 알맞은 학습 주제를 찾고 STEAM 수업을 준비할 수 있으며 STEAM 교수학습 준거에 맞는 STEAM 수업을 설계할 수 있습니다. 또한 STEAM 수업 계획에 맞춰 수업을 실행할 수 있습니다.'
    },
    {
      url: "04_03.html",
      subTitle: 'STEAM 수업, 어떻게 시작할까?<br />여러분, STEAM 수업 실천을 위해서 가장 먼저 해야 할 것은 무엇이라 생각하시나요? STEAM 수업을 시작하기 위해서는 STEAM 교육에 적합한 주제를 선정하는 것이 가장 먼저 선행되어야 합니다. 따라서 이번 시간에는 STEAM 수업 주제를 선정하기 위한 6가지 팁을 드리고자 합니다. 첫 번째로, 학생의 흥미를 찾는 과정이 필요합니다. 학생들이 많이 이용하는 온라인 플랫폼과 관련된 내용을 검색하거나 학생들에게 직접 질문하는 방법으로 최근의 관심사를 정리합니다. STEAM 교육은 실생활 속 문제를 해결할 수 있는 역량을 함양하는 교육이기에 실생활에서 쉽게 접할 수 있는 주제를 선택하고, 이때 학생들의 진로와 연계한 주제를 찾는 것을 권장합니다. 두 번째로, 기사나 뉴스 등의 대중매체를 활용해 사회적 이슈를 찾는 것이 좋습니다. 이는 사회적 이슈가 학생 자신의 삶에 어떠한 영향을 끼치는지, 그리고 그 이슈 자체에 대한 올바른 이해의 기회를 제공하게 됩니다. 세 번째로, 다양한 교과의 교과서를 분석하는 것입니다. 2015 개정 교육과정의 교과서에는 ‘창의융합형 인재 양성’이라는 목표 달성에 걸맞은 다양한 실생활 문제를 포함하고 있어, 이를 참고하는 것도 많은 도움이 될 것입니다. 네 번째로, 학교 구성원과 소통하는 것입니다. 학생과 교사 등 학교 구성원과 충분한 공감대를 형성하기 위해 의사소통의 과정을 가집니다. 동일 학년, 동일 교과 교사들부터 시작하여 공통의 주제를 찾고, 아이디어를 공유하는 방법도 좋은 방법입니다. 이때 교사 학습공동체를 결성하는 방법도 좋은 사례가 될 수 있겠죠? 다섯 번째로, 검색엔진을 충분히 활용하여 사람들의 메가트렌드(Mega Trend)와 흥미를 파악합니다. 검색엔진의 연관 검색어를 통해 요즘 사람들이 어떤 문제를 고민하는지, 어떤 문제에 관심이 있는지를 알 수 있는데요. STEAM 교육은 현실 문제 상황을 해결하는 창의적인 방법이 주요 문제가 되므로, 연관 검색어를 통해 하나의 사건에 대해 여러 가지 관점을 파악할 수 있습니다. 마지막, 여섯 번째로, STEAM 사이트를 이용하는 방법입니다. 수업 주제를 선정하기 어렵다면 기 개발되어 있는 자료를 참고하여 주제를 선별하면 되는데요. STEAM 사이트 검색창에서 ‘콘텐츠 맵’이라고 검색하면 교과, 단원별로 STEAM 프로그램을 다운로드 받을 수 있습니다.'
    },
    {
      url: "04_04.html",
      subTitle: 'STEAM 수업 계획<br />STEAM 교육 계획 단계에서는 고려해야 할 사항들이 있습니다. 먼저 STEAM 교육에서 다루고자 하는 중심 주제와 관련 있는 교과의 학습내용 요소를 파악합니다. 이후 STEAM 교육을 어떤 교과와 함께 운영해야 할지를 선정하고, 혼자서 운영할지 협력 수업으로 진행하는지 여부를 결정합니다. STEAM 교육은 창의적 체험활동과도 연계하여 운영할 수 있죠. 창의적 체험활동은 자율활동, 진로활동 등으로 나눌 수 있는데, STEAM 데이 행사를 활용하면 좋습니다. STEAM 데이는 체험부스 운영, 전시회, 발표회의 형태로 운영할 수 있습니다. 운영 시 학생들의 활동을 학교생활기록부에 기재하기 위해서는 단위학교 교육과정 운영계획에 해당 내용을 포함하거나 STEAM 데이 행사 운영계획을 사전에 준비하시면 좋습니다. STEAM 수업의 성패는 누구와 함께 운영하느냐에 따라서도 많이 좌우됩니다. STEAM 교육을 연구하는 교사 학습공동체가 있는 경우에는 STEAM 주제 선정 단계에서 교사연구회 교사들의 교과를 고려하여 주제를 선정해야 합니다. 반면, STEAM 교사연구회가 없는 경우에는 동일 학생 집단에 STEAM 프로그램을 적용해야 하므로 동일 학년 수업에 들어가는 교사들로 편성하는 것이 성취기준 선정과 평가 등에 유리합니다. 교사 학습공동체 구성이 어렵거나 협조를 구할 수 없을 때에도 STEAM 교육을 운영할 수 있습니다. STEAM 교육은 단일 교과 내에서 학습내용 간의 연계활동을 통해 운영이 가능합니다. 혼자서 STEAM 수업을 운영해야 할 경우에는 타교과와의 협의 과정이 필요 없고, 본인의 교과활동 안에서 운영되기 때문에 수업시간 편성, 교육과정 재구성에도 자유로울 수 있는 장점이 있습니다. STEAM 수업을 구성하기 위해서는 여러 교과가 연계되는 경우가 많으므로 교과 연계형 STEAM 수업의 사례를 기준으로 말씀드리겠습니다. 교육과정을 살펴보고 주제를 정해 연계할 교과를 선정해야 하는데 이때 중요한 것은 교육과정에서 벗어나지 않도록 교육과정의 내용을 반영하도록 합니다. 교육과정 속에는 각 교과별 내용 요소, 성취기준, 평가 등이 포함되어 있는데요. 이를 고려하여 계획합니다. 연계할 교과를 선정했다면, 어떠한 활동을 진행할지, 이를 구성해야 합니다. 각 교과 교사들과도 협력을 한다면 교사들마다 즐겨 하는 활동이 다양할 것입니다. 그러면 양질의 STEAM 수업을 설계하기 위해 함께 할 교사들이 모여 활동을 위한 생각을 펼치고, 활동 흐름을 결정해야 할 것입니다. 함께 할 교사들이 모여 STEAM 수업 주제와 교육과정 성취기준을 달성하기에 적합한 다양한 활동에 대해 브레인스토밍, 브레인라이팅하는 시간을 갖는 것이 중요합니다. 담당 교과의 교사가 수업 활동에 대해 머릿속으로 생각하고, 포스트잇을 활용한 마인드맵을 통해 각 교과 수업 내용을 다른 교사들과 공유하고, 서로 피드백 하는 시간이 필요합니다. 만약 동일 학교 교사 간의 협업이 아닐 경우에는 온라인 플랫폼을 활용하는 방법도 추천합니다. 마지막으로 각 차시는 어떠한 STEAM 수업활동으로 구성되어야 할까요? 교과별 수업 내용, 학습자의 학습능력, 학습준비물 확보 여부, 수업 장소 등을 고려한 후 수업 주제와 연계된 흐름을 파악하여 적합한 활동을 결정하는 것이 좋습니다. 수업활동이 결정되면 각 교과별로 수업에 필요한 차시 수와 수업 전개 순서를 결정합니다. STEAM 수업 주제와 각 교과별 교육과정의 성취기준 및 수업활동들이 결정되면 STEAM 교수학습 준거에 맞도록 수업을 설계합니다. 그럼 지금부터 STEAM 수업 구성을 어떻게 해야 하는지 ‘현대 과학기술로 만나는 우리 옛 별자리 28수’라는 수업 사례를 통해 살펴보도록 하겠습니다. 현대 과학기술로 만나는 우리 옛 별자리 28수에 관한 STEAM 교육 학습을 진행한다고 가정해보면, 상황 제시에서는 현대인의 별자리인 서양의 별자리와 역사 속 인물인 장영실이 바라본 동양의 별자리 관측의 차이점을 문화와 사상적 관점으로 해석한 자료를 찾아 비교 분석해 봅니다. 그리고 별자리를 인간의 삶 속에서 활용한 사례를 조사하도록 합니다. 이러한 활동을 통해 학생들로 하여금 자연스럽게 “우리의 별자리는 없을까?”라는 궁금증을 가질 수 있도록 다양한 인풋을 제시해 줍니다. 이러한 질문을 바탕으로 우리 옛 별자리를 현대인들에게 알릴 수 있는 방안을 논의하고, 그 대안으로 우리 옛 별자리 도록을 만들어 보는 활동을 진행하여 도록 제작을 위한 토론 활동을 해봅니다. 그러기 위해서는 우리 옛 별자리 도록 제작을 위해서는 충분한 자료조사가 선행되어야겠죠? 앞서 작성한 자료를 토대로 학생들이 우리 옛 별자리에 대해 스스로 이해하고 널리 홍보하기 위해 한자 기록물로만 되어있는 별자리 이름을 한글화하는 작업을 진행하였습니다. 다음은 천상열차분야지도에 수록된 우리 옛 별자리 기록을 한글화한 학생들의 별자리 도록 작품입니다. 이러한 과정을 통해 사람들에게 잊혀 질 수 있었던 우리 옛 별자리를 기억할 수 있는 교육이 가능합니다. 여기서 끝나는 것이 아니라 심화 활동을 진행할 수 있습니다. 창의적 체험활동으로 본 수업을 연계하여 골판지를 활용한 플라네테리움 제작활동을 진행하였습니다. 보시는 바와 같이 제작 회의를 하고 골판지 재단 작업부터 상판, 벽면 등을 설계하여 플레네테리움을 완성하였습니다. 이처럼 창의적 체험활동은 장기간에 걸쳐 연구활동이 이어질 수 있다는 장점을 활용할 수 있습니다. 우리 옛 별자리를 홍보할 수 있는 또 다른 활동으로 우리 옛 별자리를 홍보를 위한 별자리 설명기 제작이 있습니다. 다음은 우리 옛 별자리 홍보를 위한 별자리 설명기를 제작하는 모습입니다. 적외선센서를 활용한 앱코딩 작업을 하고 LED와 연결하여 별자리를 나타낼 수 있습니다. 마지막으로 다음은 우리 옛 별자리를 투명 반구에 각인 후 투영하여 장영실이 바라본 하늘의 별자리를 표현한 작품입니다. 이렇게 STEAM 교수학습 준거 선정 시에 ‘상황 제시’는 수업 서두에 한 번 정도만 이루어지도록 해주시는 것이 좋습니다. 수업을 구성하신 후 다음 체크리스트를 활용하여 수업을 점검합니다.'
    },
    {
      url: "04_05.html",
      subTitle: 'STEAM 수업 실행<br />모든 계획을 마쳤다면, STEAM 수업에 참여하는 모든 선생님이 모여 수업 전 마지막으로 수업의 흐름과 목표, 평가 방법 등을 체크하는 것이 좋습니다. 그럼 지금부터 STEAM 수업 전 체크해봐야 할 사항에 대해 자세하게 살펴보도록 하겠습니다. 먼저 STEAM 교육을 실천하기 위해 가장 중요한 것이 바로 수업의 흐름을 점검하는 것인데, 첫째로 수업의 목표와 구성을 확인합니다. 전체 STEAM 수업을 구성하는 각 교과의 활동이 상황 제시에서 언급했던 목표와 성취수준에는 적합한지, 차시 간 흐름은 어색하지 않은지, 창의적 설계에 해당하는 교과 수업들을 진행하고 나면 상황 제시의 문제를 해결할 수 있는지 확인해야 합니다. 둘째, 각 교과에서 구성한 활동이 학생 수준에 적합한지, 학생 중심의 활동으로 구성되어 있는지, 정해진 시간 동안에 할 수 있는 양인지 확인할 필요가 있습니다. 특히, 제작 활동이 많은 프로그램은 예상보다 시간이 많이 걸리므로, 여유 있게 수업 시간을 정하는 것이 좋습니다. 셋째, 평가 기준을 확인한 후 평가 요목을 협의해야 합니다. 평가는 교수학습 목표가 제대로 달성되었는지 확인하는 가장 좋은 방법으로 모든 교과에서 교사 평가를 넣을 필요는 없지만, 자기평가나 동료평가 등을 통해 스스로의 활동을 돌아볼 수 있도록 구성해야 하겠습니다. STEAM 수업 실행 전 체크해야 할 항목에는 무엇이 있을까요? 첫째, STEAM 수업 프로그램이 학생 혼자서 활동하는 프로그램이 아닌 경우에는 모둠을 구성해야 하는데 이때 협업하는 교과마다 활동 모둠이 자주 변경된다면 학생들의 혼선을 빚을 수 있습니다. 때문에 모둠 구성의 통일성을 기해야 합니다. 둘째, 수업 준비물을 정리하고, 구입해야 합니다. 준비물은 같은 재료를 여러 교과에서 사용하는 경우가 있으므로 미리 파악하여 중복해서 구입하지 않도록 합니다. 셋째, 수업 활동에 필요한 활동지를 확인합니다. 수업 활동에서 학생들의 참여와 의견 제시를 위해서는 수업 활동지 디자인이 가장 중요하기 때문입니다. 또한, 첨단 기자재는 인체에 무해한 재료로 준비하는 것이 좋습니다. 넷째, STEAM 수업 장소를 결정해야 합니다. 교과 활동에 따라 수업 장소가 교실 이외의 장소를 활용할 수도 있기 때문입니다. 다섯 번째, STEAM 수업의 연계성을 높이기 위해서는 수업시간표를 조정하는 것이 효과적입니다. 주 단위 편성의 경우 인위적인 시간표 변경이 없어서 학생들의 혼선을 최소화할 수 있고, 만약 시간표 조정이 가능한 경우 블록타임으로 편성할 수 있습니다. 블록타임의 경우 공통 준비물 및 수업 차시가 순차적으로 진행되어 연계성을 높일 수 있습니다. 마지막으로 여러 교과에서 함께 STEAM 수업을 진행한다면, 수업을 시작하기 전 학생들에게 수업에 대한 공지가 필요합니다. STEAM 수업의 주제, 적용 기간, 함께하는 교과, 준비물, 수업 장소, 모둠 구성, 변경된 시간표 등이 포함된 안내문을 만들어 수업 학급에 안내해야 하고, 만약 수업 내용의 평가가 병행된다면 평가 기준도 안내문에 포함하면 효과적일 것입니다. STEAM 수업 후에는 수업에 참여한 교사협의회와 학생 인터뷰가 진행되어야 합니다. 수업은 담당교사 혼자서 운영하는 것이 아니기 때문에 수업 속에서 각자의 입장에서 느낀 점과 추후 STEAM 프로그램의 개선점에 대한 논의가 필요합니다. ‘수업’과 ‘평가’는 동시성을 띠고, 계획된 평가를 실시해야 하기 때문입니다. 마지막으로 학생 인터뷰의 과정은 STEAM 교육의 수혜자인 학생들의 성장과정에서 느끼게 된 솔직한 이야기를 통한 선순환적 피드백이 가능하기에 더욱 중요합니다.'
    },
    {
      url: "04_06.html",
      subTitle: '오늘 배운 내용을 간단한 퀴즈를 통해 확인해 봅시다. 문제는 총 3문제입니다.'
    },
    {
      url: "04_07.html",
      subTitle: '오늘 배운 내용을 정리해보세요.<br />오늘은 STEAM 수업, 어떻게 시작할까?에서 시작하여 STEAM 교육을 계획하고 실천하는 과정을 살펴보았는데요, STEAM 주제를 찾기 위해서는 먼저, 학생의 흥미를 찾고, 대중매체를 활용하여 사회적 이슈를 찾을 필요가 있습니다. 또한, 다양한 교과서를 분석하고, 학교 구성원들과 충분히 소통하는 것도 필요한 일입니다. 그리고 검색엔진을 활용하여 사람들의 흥미를 분석하고, STEAM 사이트를 활용하여 주제를 찾을 수도 있습니다. 교과 연계 STEAM 수업을 진행할 때는 교사연구회의 도움을 받아보는 것도 좋습니다. 만약 교사연구회가 없다면, 동일 학년 담당교사와 편성하는 것이 효율적이며, 교사연구회가 있다면, 연구회 소속 교사의 교과를 고려하여 수업 주제를 선정하도록 하면 됩니다. 교육과정을 살펴보는 일 또한 매우 중요한데요. 교육과정 속 내용 요소, 성취기준, 평가 등을 고려해야 하며, 만약 교육과정을 벗어나는 내용으로 성취기준이 없을 때에는 가급적 창의적 체험활동을 통해 다루도록 합니다. STEAM 교수학습 준거를 선정할 때는 상황 제시는 가급적 한 번만 제시하고, STEAM 수업 체크리스트를 통해 교수학습 준거가 적합한지 점검해야 합니다. STEAM 수업 실행 전에는 여섯 가지 사항을 체크해야 하는데요. 첫째, 모둠 구성의 통일성, 둘째, 수업 준비물 정리 및 구입하기, 셋째, 수업 자료 준비하기, 넷째, STEAM 수업 장소 결정하기, 다섯째, 수업시간표 변경하기, 여섯째, 학생들에게 공지하기입니다. 마지막으로 STEAM 수업을 하기 위한 1년의 연간 계획 예시를 보여드리겠습니다. 새 학기가 시작되는 3월과 4월에는 우리 반 학생들의 특성을 파악하고 수업 내용을 고민하는 시기입니다. 이후 선생님들께서 충분히 고민하신 내용을 바탕으로 5월에 STEAM 온라인 연수를 듣습니다. 연수를 통해 선생님들께서 방향성을 점검해보시거나 상세 과정을 계획하실 수 있을 겁니다. 8월부터는 본격적으로 여름방학을 활용하여 본격적으로 STEAM 교육과정을 개발하고 10월부터는 적용해보는 시기입니다. 그럼 대략 학기가 끝나는 12월에는 STEAM 수업도 마무리가 되겠죠? 한 학기, 한 해를 마무리하면서 나의 STEAM 수업은 어떠했는지 스스로, 혹은 같이 참여했던 동료 선생님들, 학생들과 피드백 하는 시간을 가져봅니다. 이를 토대로 겨울방학을 이용해서 선생님들의 STEAM 수업을 업그레이드하는 기간을 가져보시는 것도 좋습니다. 오늘은 이렇게 STEAM 수업이 처음 구성부터 끝까지 어떤 과정을 거쳐 만들어지고 적용되는지를 살펴보았는데요, 선생님들께서도 선생님들만의 STEAM 수업을 구성해보시기 바랍니다.'

    },
    {
      url: "04_08.html",
      subTitle: ''
    }
  ];

  var thisFileName = document.URL.substring(document.URL.lastIndexOf("/") + 1, document.URL.length);
  var fileSeq = thisFileName.split("_")[1].substring(0, 2);
  console.log(thisFileName);
  console.log(fileSeq);

  var subTitle = $(".subtitle p");

  for (var i = 0; i < subTitles.length; i++) {
    if (subTitles[i].url == thisFileName) {
      console.log(subTitles[i].url);
      subTitle.html(subTitles[i].subTitle);
    }
  }
});
